[FunctionHelp]
$casenum9=9@$Casenum@$CASENUM@目前的觀察值順序編號。對於每個觀察值而言，$CASENUM 是目前所讀取的最多觀察值數目，其中會包含該觀察值。其格式為 F8.0。$CASENUM 值並不一定是資料編輯程式視窗 (提供於視窗化環境) 的列編號，此外，若已排序檔案或已在檔案結尾處之前插入新的觀察值，則此值會有所變更。
$sysmis10=10@$Sysmis@$SYSMIS@系統遺漏值。系統遺漏值會以句點 (.) 或當作為任何小數點符號來顯示。
$date4=4@$Date@$DATE@以二位數年份的國際日期格式來表示目前日期。其格式為 A9，形式為 dd-mmm-yy。
$jdate4=4@$JDate@$JDATE@自 1582 年 10 月 14 日 (公曆第 1 天) 算起至目前日期為止的天數。其格式為 F6.0。
$date114=4@$Date11@$DATE11@以四位數年份的國際日期格式來表示目前日期。其格式為 A11，形式為 dd-mmm-yyyy。
$time4=4@$Time@$TIME@目前日期和時間。$TIME 代表自 1582 年 10 月 14 日午夜，至執行轉換指令之日期和時間為止的秒數。其格式為 F20。您可採用多種不同的日期格式，將其顯示為日期。您亦可將其用於日期和時間函數。
abs1=1@Abs@ABS(?)@ABS(numexpr)。數值。傳回 numexpr 的絕對值 (其必須為數值)。
any13=13@Any@ANY(?,?)@ANY(test,value[,value,...])。邏輯。若檢定值符合任一後續值，則會傳回 1 或 true；反之則會傳回 0 或 false。此函數需要兩個以上的引數。例如，若 var1 值為 1、3 或 5，則 ANY(var1, 1, 3, 5) 會傳回 1；若 var1 值為其他數值，則會傳回 0。ANY 亦可用來掃瞄數值的變數或運算式清單。例如，若在三個指定變數中有任一變數的數值為 1，則 ANY(1, var1, var2, var3) 會傳回 1；若三個指定變數的數值皆不為 1，則會傳回 0。
applymodel19=19@Applymodel@ApplyModel(?,?,?)@ApplyModel(handle, "function", value).數值。使用 handle 指定的模式，將特定分數函數套用至輸入觀察值資料，而其中的 "function" 屬於下列用引號括住的字串文字值之一：predict、stddev、probability、confidence、nodeid、cumhazard、neighbor、distance。模式處理為與外部 XML 檔案相關的名稱，如 MODEL HANDLE 指令所定義。選擇性的第三個引數在函數為「probability」、「neighbor」或「distance」時適用。「probability」設定一個分類，在其中計算機率。至於 "neighbor" 和 "distance" 則指定 neighbor (為整數) 作為鄰近 neighbor 的模式。若無法計算數值，則 ApplyModel 會傳回系統遺漏值。
arsin1=1@Arsin@ARSIN(?)@ARSIN(numexpr)。數值。傳回以弧度表示的 numexpr 逆正弦 (反正弦)，其必須評估為介於 -1 與 +1 之間的數值。
artan1=1@Artan@ARTAN(?)@ARTAN(numexpr)。數值。傳回以弧度表示的 numexpr 逆正切 (反正切)，其必須為數值。
cdf.bernoulli2=2@Cdf.Bernoulli@CDF.BERNOULLI(?,?)@CDF.BERNOULLI(quant, prob)。數值。傳回數值小於或等於量的累積機率，該數值來自帶有指定機率參數的 Bernoulli 分配。
cdf.beta2=2@Cdf.Beta@CDF.BETA(?,?,?)@CDF.BETA(quant, shape1, shape2)。數值。傳回數值小於量的累積機率，該數值來自具有指定形狀參數的 Beta 分配。
cdf.binom2=2@Cdf.Binom@CDF.BINOM(?,?,?)@CDF.BINOM(quant, n, prob)。數值。傳回累積機率：亦即 n 次試驗中的每項成功個數皆帶有 prob 機率，並且小於或等於量。若 n 為 1，則會與 CDF.BERNOULLI 相同。
cdf.bvnor2=2@Cdf.Bvnor@CDF.BVNOR(?)@CDF.BVNOR(quant1, quant2, corr)。數值。傳回數值小於量 1 和量 2 的累積機率，該數值來自帶有指定相關參數的標準雙變數常態分配。
cdf.cauchy2=2@Cdf.Cauchy@CDF.CAUCHY(?,?,?)@CDF.CAUCHY(quant, loc, scale)。數值。傳回數值小於量的累積機率，該數值來自帶有指定位置和尺度參數的 Cauchy 分配。
cdf.chisq2=2@Cdf.Chisq@CDF.CHISQ(?,?)@CDF.CHISQ(quant, df)。數值。傳回數值小於量的累積機率，該數值來自帶有 df 自由度的卡方分配。
cdf.exp2=2@Cdf.Exp@CDF.EXP(?,?)@CDF.EXP(quant, scale)。數值。傳回數值小於量的累積機率，該數值來自具有指定尺度參數的指數分配。
cdf.f2=2@Cdf.F@CDF.F(?,?,?)@CDF.F(quant, df1, df2)。數值。傳回數值小於量的累積機率，該數值來自帶有 df1 與 df2 自由度的 F 分配。
cdf.gamma2=2@Cdf.Gamma@CDF.GAMMA(?,?,?)@CDF.GAMMA(quant, shape, scale)。數值。傳回數值小於量的累積機率，該數值來自帶有指定形狀和尺度參數的 Gamma 分配。
cdf.geom2=2@Cdf.Geom@CDF.GEOM(?,?)@CDF.GEOM(quant, prob)。數值。傳回累積機率，亦即當機率指定成功機率時，取得成功的試驗個數會小於或等於量。
cdf.halfnrm2=2@Cdf.Halfnrm@CDF.HALFNRM(?)@CDF.HALFNRM(quant, mean, stddev)。數值。傳回數值小於量的累積機率，該數值來自帶有指定平均數與標準差的半常態分配。
cdf.hyper2=2@Cdf.Hyper@CDF.HYPER(?,?,?,?)@CDF.HYPER(quant, total, sample, hits)。數值。傳回累積機率，亦即當從擁有指定特性拜訪人數的全域大小總數中隨機選取樣本物件時，帶有指定特性的物件個數會小於或等於量。
cdf.igauss2=2@Cdf.Igauss@CDF.IGAUSS(?,?,?)@CDF.IGAUSS(quant, loc, scale)。數值。傳回數值小於量的累積機率，該數值來自帶有指定位置和尺度參數的反向 Gaussian 分配。
cdf.laplace2=2@Cdf.Laplace@CDF.LAPLACE(?,?,?)@CDF.LAPLACE(quant, mean, scale)。數值。傳回數值小於量的累積機率，該數值來自帶有指定平均數和尺度參數的 Laplace 分配。
cdf.lnormal2=2@Cdf.Lnormal@CDF.LNORMAL(?,?,?)@CDF.LNORMAL(quant, a, b)。數值。傳回數值小於量的累積機率，該數值來自帶有指定參數的對數常態分配。
cdf.logistic2=2@Cdf.Logistic@CDF.LOGISTIC(?,?,?)@CDF.LOGISTIC(quant, mean, scale)。數值。傳回數值小於量的累積機率，該數值來自帶有指定平均數和尺度參數的 Logistic 分配。
cdf.negbin2=2@Cdf.Negbin@CDF.NEGBIN(?,?,?)@CDF.NEGBIN(quant, thresh, prob)。數值。傳回累積機率，亦即當門檻參數為 thresh，且機率指定成功機率時，取得成功的試驗個數會小於或等於量。
cdf.normal2=2@Cdf.Normal@CDF.NORMAL(?,?,?)@CDF.NORMAL(quant, mean, stddev)。數值。傳回數值小於量的累積機率，該數值來自帶有指定平均數與標準差的常態分配。
cdf.pareto2=2@Cdf.Pareto@CDF.PARETO(?,?,?)@CDF.PARETO(quant, threshold, shape)。數值。傳回數值小於量的累積機率，該數值來自帶有指定門檻和形狀參數的 Pareto 分配。
cdf.poisson2=2@Cdf.Poisson@CDF.POISSON(?,?)@CDF.POISSON(quant, mean)。數值。傳回數值小於或等於量的累積機率，該數值來自帶有指定平均數或比率參數的 Poisson 分配。
cdf.smod2=2@Cdf.Smod@CDF.SMOD(?)@CDF.SMOD(quant, a, b)。數值。傳回數值小於量的累積機率，該數值來自帶有指定參數的 Studentized 最大絕對值。
cdf.srange2=2@Cdf.Srange@CDF.SRANGE(?)@CDF.SRANGE(quant, a, b)。數值。傳回數值小於量的累積機率，該數值來自帶有指定參數的 Studentized 範圍統計量。
cdf.t2=2@Cdf.T@CDF.T(?,?)@CDF.T(quant, df)。數值。傳回數值小於量的累積機率，該數值來自帶有指定 df 自由度的 Student's t 分配。
cdf.uniform2=2@Cdf.Uniform@CDF.UNIFORM(?,?,?)@CDF.UNIFORM(quant, min, max)。數值。傳回數值小於量的累積機率，該數值來自帶有指定最小值和最大值的均勻分配。
cdf.weibull2=2@Cdf.Weibull@CDF.WEIBULL(?,?,?)@CDF.WEIBULL(quant, a, b)。數值。傳回數值小於量的累積機率，該數值來自帶有指定參數的 Weibull 分配。
cdfnorm2=2@Cdfnorm@CDFNORM(?)@CDFNORM(zvalue)。數值。傳回機率，亦即隨機變數會帶有 0 平均數與 1 標準差，且必須為小於 zvalue 的數值。
cfvar15=15@Cfvar@CFVAR(?,?)@CFVAR(numexpr,numexpr[,...])。數值。傳回具備有效數值的本身引數變異係數 (除以平均數後得出的標準差)。此函數需要兩個或以上的引數 (必須是數值)。您可為此要評估的函數指定有效引數的最小個數。
char.index(2)16=16@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(haystack, needle[, divisor])。數值。傳回表示 needle 在 haystack 中首次出現字元位置的數字。選用的第三個引數 (divisor) 是用來將 needle 分成個別字串的字元數字。每個子字串皆會用來進行搜尋，而函數會傳回首次出現的任何子字串。例如，CHAR.INDEX(var1, 'abcd') 會傳回 var1 字串變數中的「abcd」完整字串起始位置數值；CHAR.INDEX(var1, 'abcd', 1) 會傳回首次出現字串中任何數值的位置數值；而 CHAR.INDEX(var1, 'abcd', 2) 會傳回首次出現「ab」或「cd」的數值。Divisor 必須為正整數，且必須平均區分於 needle 長度。若 haystack 中沒有出現 needle，則會傳回 0。
char.index(3)16=16@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(haystack, needle[, divisor])。數值。傳回表示 needle 在 haystack 中首次出現字元位置的數字。選用的第三個引數 (divisor) 是用來將 needle 分成個別字串的字元數字。每個子字串皆會用來進行搜尋，而函數會傳回首次出現的任何子字串。例如，CHAR.INDEX(var1, 'abcd') 會傳回 var1 字串變數中的「abcd」完整字串起始位置數值；CHAR.INDEX(var1, 'abcd', 1) 會傳回首次出現字串中任何數值的位置數值；而 CHAR.INDEX(var1, 'abcd', 2) 會傳回首次出現「ab」或「cd」的數值。Divisor 必須為正整數，且必須平均區分於 needle 長度。若 haystack 中沒有出現 needle，則會傳回 0。
char.index(2)13=13@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(haystack, needle[, divisor])。數值。傳回表示 needle 在 haystack 中首次出現字元位置的數字。選用的第三個引數 (divisor) 是用來將 needle 分成個別字串的字元數字。每個子字串皆會用來進行搜尋，而函數會傳回首次出現的任何子字串。例如，CHAR.INDEX(var1, 'abcd') 會傳回 var1 字串變數中的「abcd」完整字串起始位置數值；CHAR.INDEX(var1, 'abcd', 1) 會傳回首次出現字串中任何數值的位置數值；而 CHAR.INDEX(var1, 'abcd', 2) 會傳回首次出現「ab」或「cd」的數值。Divisor 必須為正整數，且必須平均區分於 needle 長度。若 haystack 中沒有出現 needle，則會傳回 0。
char.index(3)13=13@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(haystack, needle[, divisor])。數值。傳回表示 needle 在 haystack 中首次出現字元位置的數字。選用的第三個引數 (divisor) 是用來將 needle 分成個別字串的字元數字。每個子字串皆會用來進行搜尋，而函數會傳回首次出現的任何子字串。例如，CHAR.INDEX(var1, 'abcd') 會傳回 var1 字串變數中的「abcd」完整字串起始位置數值；CHAR.INDEX(var1, 'abcd', 1) 會傳回首次出現字串中任何數值的位置數值；而 CHAR.INDEX(var1, 'abcd', 2) 會傳回首次出現「ab」或「cd」的數值。Divisor 必須為正整數，且必須平均區分於 needle 長度。若 haystack 中沒有出現 needle，則會傳回 0。
char.length16=16@Char.Length@CHAR.LENGTH(?)@CHAR.LENGTH(strexpr)。數值。以字元傳回 strexpr 的長度，並移除所有尾隨的空白。
char.lpad(2)16=16@Char.Lpad(2)@CHAR.LPAD(?,?)@CHAR.LPAD(strexpr1,length[,strexpr2])。字串。儘量使用適配 strexpr2 的最多完整副本來作為填塞字串，藉以將 strexpr1 向左填塞，使其長度合乎由長度指定的數值。長度數值代表字元數字，且必須為正整數。若刪除選用的 strexpr2 引數，則會以空格來填塞數值。
char.lpad(3)16=16@Char.Lpad(3)@CHAR.LPAD(?,?,?)@CHAR.LPAD(strexpr1,length[,strexpr2])。字串。儘量使用適配 strexpr2 的最多完整副本來作為填塞字串，藉以將 strexpr1 向左填塞，使其長度合乎由長度指定的數值。長度數值代表字元數字，且必須為正整數。若刪除選用的 strexpr2 引數，則會以空格來填塞數值。
char.mblen16=16@Char.Mblen@CHAR.mblen(?,?)@CHAR.MBLEN(strexpr,pos)。數值。傳回以 strexpr 字元位置 pos 之字元表示的位元組數。
char.rindex(2)16=16@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(haystack,needle[,divisor])。數值。傳回指示 haystack 字串中最後出現 needle 字串之起始字元位置的整數。選用的第三個引數 (divisor) 是用來將 needle 分成個別字串的字元數字。例如，CHAR.RINDEX(var1, 'abcd') 會傳回 var1 變數中最後出現「abcd」完整字串的起始位置；CHAR.RINDEX(var1, 'abcd', 1) 會傳回最後出現字串中任何數值的位置數值；而 CHAR.RINDEX(var1, abcd', 2) 會傳回最後出現「ab」或「cd」的起始位置數值。Divisor 必須為正整數，且必須平均區分於 needle 長度。若沒有發現 needle，則會傳回 0 數值。
char.rindex(3)16=16@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(haystack,needle[,divisor])。數值。傳回指示 haystack 字串中最後出現 needle 字串之起始字元位置的整數。選用的第三個引數 (divisor) 是用來將 needle 分成個別字串的字元數字。例如，CHAR.RINDEX(var1, 'abcd') 會傳回 var1 變數中最後出現「abcd」完整字串的起始位置；CHAR.RINDEX(var1, 'abcd', 1) 會傳回最後出現字串中任何數值的位置數值；而 CHAR.RINDEX(var1, abcd', 2) 會傳回最後出現「ab」或「cd」的起始位置數值。Divisor 必須為正整數，且必須平均區分於 needle 長度。若沒有發現 needle，則會傳回 0 數值。
char.rindex(2)13=13@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(haystack,needle[,divisor])。數值。傳回指示 haystack 字串中最後出現 needle 字串之起始字元位置的整數。選用的第三個引數 (divisor) 是用來將 needle 分成個別字串的字元數字。例如，CHAR.RINDEX(var1, 'abcd') 會傳回 var1 變數中最後出現「abcd」完整字串的起始位置；CHAR.RINDEX(var1, 'abcd', 1) 會傳回最後出現字串中任何數值的位置數值；而 CHAR.RINDEX(var1, abcd', 2) 會傳回最後出現「ab」或「cd」的起始位置數值。Divisor 必須為正整數，且必須平均區分於 needle 長度。若沒有發現 needle，則會傳回 0 數值。
char.rindex(3)13=13@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(haystack,needle[,divisor])。數值。傳回指示 haystack 字串中最後出現 needle 字串之起始字元位置的整數。選用的第三個引數 (divisor) 是用來將 needle 分成個別字串的字元數字。例如，CHAR.RINDEX(var1, 'abcd') 會傳回 var1 變數中最後出現「abcd」完整字串的起始位置；CHAR.RINDEX(var1, 'abcd', 1) 會傳回最後出現字串中任何數值的位置數值；而 CHAR.RINDEX(var1, abcd', 2) 會傳回最後出現「ab」或「cd」的起始位置數值。Divisor 必須為正整數，且必須平均區分於 needle 長度。若沒有發現 needle，則會傳回 0 數值。
char.rpad(2)16=16@Char.Rpad(2)@CHAR.RPAD(?,?)@CHAR.RPAD(strexpr1,length[,strexpr2])。字串。儘量使用適配 strexpr2 的最多完整副本來作為填塞字串，藉以使用 strexpr2 將 strexpr1 向右填塞，使其合乎由長度指定的長度。長度數值代表字元數字，且必須為正整數。選用的第三個引數 strexpr2 為用來解析字串的引號字串或運算式。若省略 strexpr2 ，則會以空格來填塞數值。
char.rpad(3)16=16@Char.Rpad(3)@CHAR.RPAD(?,?,?)@CHAR.RPAD(strexpr1,length[,strexpr2])。字串。儘量使用適配 strexpr2 的最多完整副本來作為填塞字串，藉以使用 strexpr2 將 strexpr1 向右填塞，使其合乎由長度指定的長度。長度數值代表字元數字，且必須為正整數。選用的第三個引數 strexpr2 為用來解析字串的引號字串或運算式。若省略 strexpr2 ，則會以空格來填塞數值。
char.substr(2)16=16@Char.Substr(2)@CHAR.SUBSTR(?,?)@CHAR.SUBSTR(strexpr,pos[,length])。字串。傳回開始於 strexpr 字元位置 pos 的子字串。選用的第三個引數代表子字串中的字元數。若刪除選用的引數長度，則會傳回開始於 strexpr 字元位置 pos 並執行至 strexpr 結束的子字串。例如，CHAR.SUBSTR('abcd', 2) 會傳回「bcd」，而 CHAR.SUBSTR('abcd', 2, 2) 會傳回「bc」。
char.substr(3)16=16@Char.Substr(3)@CHAR.SUBSTR(?,?,?)@CHAR.SUBSTR(strexpr,pos[,length])。字串。傳回開始於 strexpr 字元位置 pos 的子字串。選用的第三個引數代表子字串中的字元數。若刪除選用的引數長度，則會傳回開始於 strexpr 字元位置 pos 並執行至 strexpr 結束的子字串。例如，CHAR.SUBSTR('abcd', 2) 會傳回「bcd」，而 CHAR.SUBSTR('abcd', 2, 2) 會傳回「bc」。
concat16=16@Concat@CONCAT(?,?)@CONCAT(strexpr,strexpr[,..])。字串。傳回的字串是必須估計至字串中的本身所有連續引數。此函數需要兩個以上的引數。在編碼頁模式中，若 strexpr 為字串變數，且您僅需要實際字串數值而不向右填塞至定義變數寬度，則使用 RTRIM。例如 CONCAT(RTRIM(stringvar1), RTRIM(stringvar2))。
cos1=1@Cos@COS(?)@COS(radians)。數值。傳回以弧度測量的弧度餘弦 (其必須為數值)。
ctime.days18=18@Ctime.Days@CTIME.DAYS(?)@CTIME.DAYS(timevalue)。數值。傳回包含分數天數的日數 (以 timevalue 表示，可為秒數、時間運算式或時間格式變數)。
ctime.hours18=18@Ctime.Hours@CTIME.HOURS(?)@CTIME.HOURS(timevalue)。數值。傳回包含分數時數的小時數 (以 timevalue 表示，可為秒數、時間運算式或時間格式變數)。
ctime.minutes18=18@Ctime.Minutes@CTIME.MINUTES(?)@CTIME.MINUTES(timevalue)。數值。傳回包含分數分鐘數的分鐘數 (以 timevalue 表示，可為秒數、時間運算式或時間格式變數)。
ctime.seconds18=18@Ctime.Seconds@CTIME.SECONDS(?)@CTIME.SECONDS(timevalue)。數值。傳回包含分數秒數的秒數 (以 timevalue 表示，可為數字、時間運算式或時間格式變數)。
date.dmy6=6@Date.Dmy@DATE.DMY(?,?,?)@DATE.DMY(day,month,year)。數值。傳回與指出的日、月和年相符的日期數值。引數必須解析為整數，其中日範圍介於 1 和 31 之間，月範圍介於 1 和 13 之間，而年的四位數整數大於 1582。若要將結果顯示為日期，請為結果變數指定日期格式。
date.mdy6=6@Date.Mdy@DATE.MDY(?,?,?)@DATE.MDY(month,day,year)。數值。傳回與指出的月、日和年相符的日期值。引數必須解析為整數，其中日範圍介於 1 和 31 之間，月範圍介於 1 和 13 之間，而年的四位數整數大於 1582。若要將結果顯示為日期，請為結果變數指定日期格式。
date.moyr6=6@Date.Moyr@DATE.MOYR(?,?)@DATE.MOYR(month,year)。數值。傳回與指出的月和年相符的日期數值。引數必須解析為整數，其中月範圍介於 1 和 13 之間，而年的四位數整數大於 1582。若要將結果顯示為日期，請為結果變數指定日期格式。
date.qyr6=6@Date.Qyr@DATE.QYR(?,?)@DATE.QYR(quarter,year)。數值。傳回與指出的季和年相符的日期數值。引數必須解析為整數，其中季範圍介於 1 和 4 之間，而年的四位數整數大於 1582。若要將結果顯示為日期，請為結果變數指定日期格式。
date.wkyr6=6@Date.Wkyr@DATE.WKYR(?,?)@DATE.WKYR(weeknum,year)。數值。傳回與指出的週數和年相符的日期數值。引數必須解析為整數，其中週數介於 1 和 53 之間，而年的四位數整數大於 1582。所傳回的日期表示所指定該年度某一週的第一天。第一週會從每一年的 1 月 1 日開始，因此任何指定一週所傳回的日期每一年都會不同。若要將結果顯示為日期，請將日期格式指派給結果變數。
date.yrday6=6@Date.Yrday@DATE.YRDAY(?,?)@DATE.YRDAY(year,daynum)。數值。傳回與指出的年和日數相符的日期數值。引數必須解析為整數，其中日數範圍介於 1 和 366 之間，而年的四位數整數大於 1582。若要將結果顯示為日期，請為結果變數指定日期格式。
datediff5=5@Datediff@DATEDIFF(?,?,?)@DATEDIFF(datetime2, datetime1, "unit")。數值。計算兩個日期/時間值之間的差異，並傳回以指定日期/時間單位表示的整數 (並截斷任何分數成份)，其中日期時間 2 與日期時間 1 皆為日期或時間格式變數 (或表示有效日期/時間值的數值)，而「單位」為下列用引號括住的字串文字值之一：年、季、月、週、天、小時、分鐘、秒。
datesum(3)5=5@Datesum(3)@DATESUM(?,?,?)@DATESUM(datetime, value, "unit", "method")。數值。藉由指定的日期或時間值來計算指定單位數字的日期或時間值，其中日期時間為日期或時間格式變數 (或是代表有效日期/時間值的數值)，而「單位」為下列用引號括住的字串文字值之一：年、季、月、週、天、小時、分鐘、秒。選用的方法會以引號括住，例如 "rollover" 或 "closest"。變換方法是將超過天數加至下個月份。最接近方法會採用月份內最相近的日期；此為預設值。傳回的數值為以秒數表示的日期/時間值。若要以日期/時間來顯示數值，請為變數指定適當的格式。
datesum(4)5=5@Datesum(4)@DATESUM(?,?,?,?)@DATESUM(datetime, value, "unit", "method")。數值。藉由指定的日期或時間值來計算指定單位數字的日期或時間值，其中日期時間為日期或時間格式變數 (或是代表有效日期/時間值的數值)，而「單位」為下列用引號括住的字串文字值之一：年、季、月、週、天、小時、分鐘、秒。選用的方法會以引號括住，例如 "rollover" 或 "closest"。變換方法是將超過天數加至下個月份。最接近方法會採用月份內最相近的日期；此為預設值。傳回的數值為以秒數表示的日期/時間值。若要以日期/時間來顯示數值，請為變數指定適當的格式。
exp1=1@Exp@EXP(?)@EXP(numexpr)。數值。傳回 numexpr 次方的 e，其中 e 表示自然對數的基礎，而 numexpr 表示數值。若 numexpr 的數值較大，則可能會產生超出機器功能所及的結果。
idf.beta8=8@Idf.Beta@IDF.BETA(?,?,?)@IDF.BETA(prob, shape1, shape2)。數值。傳回來自 Beta 分配的數值，其中會帶有指定的形狀參數，且累積機率為 prob。
idf.cauchy8=8@Idf.Cauchy@IDF.CAUCHY(?,?,?)@IDF.CAUCHY(prob, loc, scale)。數值。傳回來自 Cauchy 分配的數值，其中會帶有指定的位置與尺度參數，且累積機率為 prob。
idf.chisq8=8@Idf.Chisq@IDF.CHISQ(?,?)@IDF.CHISQ(prob, df)。數值。傳回來自卡方分配的數值，其中會帶有指定自由度 df，且累積機率為 prob。例如，若卡方數值在水準為 0.05，且自由度為 3 時屬於顯著，則其為 IDF.CHISQ(0.95,3)。
idf.exp8=8@Idf.Exp@IDF.EXP(?,?)@IDF.EXP(p, scale)。數值。傳回呈指數性減少的變數值，其中會帶有減少尺度的比率，且累積機率為 p。
idf.f8=8@Idf.F@IDF.F(?,?,?)@IDF.F(prob, df1, df2)。數值。傳回來自 F 分配的數值，其中會帶有指定自由度，且累積機率為 prob。例如，若 F 值在水準為 0.05，且自由度為 3 與 100 時屬於顯著，則其為 IDF.F(0.95,3,100)。
idf.gamma8=8@Idf.Gamma@IDF.GAMMA(?,?,?)@IDF.GAMMA(prob, shape, scale)。數值。傳回來自 Gamma 分配的數值，其中會帶有指定的形狀與尺度參數，且累積機率為 prob。
idf.halfnrm8=8@Idf.Halfnrm@IDF.HALFNRM(?)@IDF.HALFNRM(prob, mean, stddev)。數值。傳回來自半常態分配的數值，其中會帶有指定的平均數與標準差，且累積機率為 prob。
idf.igauss8=8@Idf.Igauss@IDF.IGAUSS(?,?,?)@IDF.IGAUSS(prob, loc, scale)。數值。傳回來自反向 Gaussian 分配的數值，其中會帶有指定的位置與尺度參數，且累積機率為 prob。
idf.laplace8=8@Idf.Laplace@IDF.LAPLACE(?,?,?)@IDF.LAPLACE(prob, mean, scale)。數值。傳回來自 Laplace 分配的數值，其中會帶有指定的平均數與尺度參數，且累積機率為 prob。
idf.lnormal8=8@Idf.Lnormal@IDF.LNORMAL(?,?,?)@IDF.LNORMAL(prob, a, b)。數值。傳回來自對數常態分配的數值，其中會帶有指定參數，且累積機率為 prob。
idf.logistic8=8@Idf.Logistic@IDF.LOGISTIC(?,?,?)@IDF.LOGISTIC(prob, mean, scale)。數值。傳回來自 Logistic 分配的數值，其中會帶有指定的平均數與尺度參數，且累積機率為 prob。
idf.normal8=8@Idf.Normal@IDF.NORMAL(?,?,?)@IDF.NORMAL(prob, mean, stddev)。數值。傳回來自常態分配的數值，其中會帶有指定的平均數與標準差，且累積機率為 prob。
idf.pareto8=8@Idf.Pareto@IDF.PARETO(?,?,?)@IDF.PARETO(prob, threshold, shape)。數值。傳回來自 Pareto 分配的數值，其中會帶有指定的門檻與尺度參數，且累積機率為 prob。
idf.smod8=8@Idf.Smod@IDF.SMOD(?)@IDF.SMOD(prob, a, b)。數值。傳回來自 Studentized 最大絕對值的數值，其中會帶有指定參數，且累積機率為 prob。
idf.srange8=8@Idf.Srange@IDF.SRANGE(?)@IDF.SRANGE(prob, a, b)。數值。傳回來自 Studentized 範圍統計量的數值，其中會帶有指定參數，且累積機率為 prob。
idf.t8=8@Idf.T@IDF.T(?,?)@IDF.T(prob, df)。數值。傳回來自 Student's t 分配的數值，其中會帶有指定自由度 df，且累積機率為 prob。
idf.uniform8=8@Idf.Uniform@IDF.UNIFORM(?,?,?)@IDF.UNIFORM(prob, min, max)。數值。傳回來自最小值與最大值間之均勻分配的數值，且累積機率為 prob。
idf.weibull8=8@Idf.Weibull@IDF.WEIBULL(?,?,?)@IDF.WEIBULL(prob, a, b)。數值。傳回來自 Weibull 分配的數值，其中會帶有指定參數，且累積機率為 prob。
lag(1)9=9@Lag(1)@LAG(?)@LAG(variable[, n])。數字或字串。前一個觀察值或是之前的 n 個觀察值中的變數值。選用的第二個引數 n 必須為正整數，而預設值為 1｡prev4=LAG(gnp,4) 會傳回位於目前觀察值前面之第四個觀察值的 gnp 值。前四個觀察值的系統遺漏值為 prev4。
lag(2)9=9@Lag(2)@LAG(?,?)@LAG(variable[, n])。數字或字串。前一個觀察值或是之前的 n 個觀察值中的變數值。選用的第二個引數 n 必須為正整數，而預設值為 1｡prev4=LAG(gnp,4) 會傳回位於目前觀察值前面之第四個觀察值的 gnp 值。前四個觀察值的系統遺漏值為 prev4。
length16=16@Length@LENGTH(?)@UPCASE(strexpr)。數值。傳回以位元組表示的 strexpr 長度，其必須為字串運算式。針對字串變數而言，在處於 Unicode 模式時，此為每個數值中的位元組個數 (不包括尾隨的空白)，但在處於編碼頁模式時，此為定義的變數長度 (含尾隨的空白)。若要在編碼頁模式中取得不含尾隨空白的長度 (以位元組表示)，請使用 LENGTH(RTRIM(strexpr))。
lg101=1@Lg10@LG10(?)@LG10(numexpr)。數值。傳回以 10 為基底的 numexpr 對數，其必須為大於 0 的數值。
ln1=1@Ln@LN(?)@LN(numexpr)。數值。傳回以 e 為基底的 numexpr 對數，其必須為大於 0 的數值。
lngamma1=1@Lngamma@LNGAMMA(?)@LNGAMMA(numexpr)。數值。傳回 numexpr 的完整 Gamma 函數對數，其必須為大於 0 的數值。
lower16=16@Lower@LOWER(?)@LOWER(strexpr)。字串。傳回 strexpr 並將大寫字母變更為小寫，而其他字母則不加以變更。此引數可為字串變數或數值。例如，若名稱 1 的數值為 Charles，則 LOWER(name1) 會傳回 charles。
ltrim(1)16=16@Ltrim(1)@LTRIM(?)@LTRIM(strexpr[,char])。字串。傳回已移除所有 char 前引實例的 strexpr。若未指定 char，則會移除前引空白。char 必須解析為單一字元。
ltrim(2)16=16@Ltrim(2)@LTRIM(?,?)@LTRIM(strexpr[,char])。字串。傳回已移除所有 char 前引實例的 strexpr。若未指定 char，則會移除前引空白。char 必須解析為單一字元。
max13=13@Max@MAX(?,?)@MAX(value,value[,..])。數字或字串。傳回其引數的最大值，該引數包含有效值。此函數需要兩個以上的引數。至於數值，您可以指定有效引數的最小數值，以便評估此函數。
max15=15@Max@MAX(?,?)@MAX(value,value[,..])。數字或字串。傳回其引數的最大值，該引數包含有效值。此函數需要兩個以上的引數。至於數值，您可以指定有效引數的最小數值，以便評估此函數。
mblen.byte16=16@Mblen.Byte@MBLEN.BYTE(?,?)@MBLEN.BYTE(strexpr,pos)。數值。傳回以 strexpr 字元位置 pos 之位元組表示的位元組數。
mean15=15@Mean@MEAN(?,?)@MEAN(numexpr,numexpr[,..])。數值。傳回其引數的算數平均數，該引數包含有效值和未遺漏值。此函數需要兩個或以上的引數 (必須是數值)。您可為此要評估的函數指定有效引數的最小個數。
median15=15@Median@Median(?,?)@MEDIAN(numexpr,numexpr[,..])。數值。傳回其引數的中位數 (第 50 個百分位數)，該引數包含有效值和未遺漏值。此函數需要兩個或以上的引數 (必須是數值)。您可為此要評估的函數指定有效引數的最小個數。
min13=13@Min@MIN(?,?)@MIN(value,value[,..])。數字或字串。傳回其引數的最小值，該引數包含有效、未遺漏值。此函數需要兩個以上的引數。至於數值，您可以指定有效引數的最小數值，以便評估此函數。
min15=15@Min@MIN(?,?)@MIN(value,value[,..])。數字或字串。傳回其引數的最小值，該引數包含有效、未遺漏值。此函數需要兩個以上的引數。至於數值，您可以指定有效引數的最小數值，以便評估此函數。
missing10=10@Missing@MISSING(?)@MISSING(variable)。邏輯。若變數含有系統遺漏值或使用者遺漏值，則傳回 1 或 true。引數應為作用中資料集內的變數名稱。
mod1=1@Mod@MOD(?,?)@MOD(numexpr,modulus)。數值。當數值運算式以絕對值區分時，回傳其餘項目。兩種引數必須是數字，且絕對值不可為 0。
ncdf.beta2=2@Ncdf.Beta@NCDF.BETA(?,?,?,?)@NCDF.BETA(量，形狀 1，形狀 2，nc)。數值。傳回數值小於量的累積機率，該數值來自具有指定形狀和非集中性參數的非集中 Beta 分配。
ncdf.chisq2=2@Ncdf.Chisq@NCDF.CHISQ(?,?,?)@NCDF.CHISQ(量，df，nc)。數值。傳回數值小於量的累積機率，該數值來自具有自由度 df，且具有指定非集中性參數的非集中卡方分配。
ncdf.f2=2@Ncdf.F@NCDF.F(?,?,?,?)@NCDF.F(量，df1，df2，nc)。數值。傳回數值小於量的累積機率，該數值來自具有自由度 df1 和 df2、非集中性 nc 的非集中 F 分配。
ncdf.t2=2@Ncdf.T@NCDF.T(?,?,?)@NCDF.T(量，df，nc)。數值。傳回數值小於量的累積機率，該數值來自具有指定自由度 df，非集中性參數 nc 的非集中 Student's 分配。
nmiss10=10@Nmiss@NMISS(?)@NMISS(variable[,..])。數值。傳回具有系統遺漏值和使用者遺漏值的引數計數。此函數需要一個或多個引數，且引數應為作用中資料集內的變數名稱。
normalize16=16@Normalize@NORMALIZE(?)@NORMALIZE(strexp)。字串。傳回 strexp 的常態化版本。在 Unicode 模式中，它會傳回 Unicode NFC。在編碼頁模式中，它不會產生任何效果，而傳回未修改的 strexp。結果的長度可能與輸入的長度不同。
npdf.beta11=11@Npdf.Beta@NPDF.BETA(?,?,?,?)@NPDF.BETA(quant, shape1, shape2, nc)。數值。傳回非集中 beta 分配的機率密度，此分配具有指定的形狀和非集中性參數，量為 quant。
npdf.chisq11=11@Npdf.Chisq@NPDF.CHISQ(?,?,?)@NPDF.CHISQ(quant, df, nc)。數值。傳回非集中卡方分配的機率密度，此分配具有自由度 df 和指定的非集中性參數，量為 quant。
npdf.f11=11@Npdf.F@NPDF.F(?,?,?,?)@NPDF.F(quant, df1, df2, nc)。數值。傳回非集中 F 分配的機率密度，此分配具有自由度 df1、df2 和非集中性 nc，量為 quant。
npdf.t11=11@Npdf.T@NPDF.T(?,?,?)@NPDF.T(quant, df, nc)。數值。傳回非集中 Student's t 分配的機率密度，此分配具有指定的自由度 df 和非集中性 nc，量為 quant。
ntrim16=16@Ntrim@NTRIM(?)@NTRIM(varname)。在不移除尾隨空白的情況下傳回 varname 的數值。Varname 的數值必須是變數名稱，不能是運算式。
number3=3@Number@NUMBER(?,?)@NUMBER(字串運算式,格式)。數值。傳回字串運算式 strexpr 的數值作為數字。第二個引數，格式，是用來讀取 strexpr 的數值格式。例如，NUMBER(stringDate,DATE11) 會將包含一般型式的日期 dd-mmm-yyyy 轉換成代表該日期的秒數數字。(若要將該數值以日期顯示，請使用 FORMATS 或 PRINT FORMATS 指令)。若字串無法使用該格式來讀取，則此函數會傳回系統遺漏值。
nvalid10=10@Nvalid@NVALID(?)@NVALID(variable[,..])。數值。傳回包含有效值和未遺漏值的引數計數。此函數需要一個或多個引數，且引數應為作用中資料集內的變數名稱。
pdf.bernoulli11=11@Pdf.Bernoulli@PDF.BERNOULLI(?,?)@PDF.BERNOULLI(quant, prob)。數值。傳回來自 Bernoulli 分配的數值等於 quant，而具有指定機率參數的機率。
pdf.beta11=11@Pdf.Beta@PDF.BETA(?,?,?)@PDF.BETA(quant, shape1, shape2)。數值。傳回 beta 分配的機率密度，此分配具有指定的形狀參數，量為 quant。
pdf.binom11=11@Pdf.Binom@PDF.BINOM(?,?,?)@PDF.BINOM(quant, n, prob)。數值。傳回 n 次試驗中，成功個數等於 quant 而每次成功的機率為 prob 的機率。若 n 為 1，則會與 PDF.BERNOULLI 相同。
pdf.bvnor11=11@Pdf.Bvnor@PDF.BVNOR(?,?,?)@PDF.BVNOR(quant1, quant2, corr)。數值。傳回標準雙變數常態分配的機率密度，此分配具有指定的相關參數，量為 quant1 和 quant2。
pdf.cauchy11=11@Pdf.Cauchy@PDF.CAUCHY(?,?,?)@PDF.CAUCHY(quant, loc, scale)。數值。傳回 Cauchy 分配的機率密度，此分配具有指定的位置和尺度參數，量為 quant。
pdf.chisq11=11@Pdf.Chisq@PDF.CHISQ(?,?)@PDF.CHISQ(quant, df)。數值。傳回卡方分配的機率密度，此分配具有自由度 df，量為 quant。
pdf.exp11=11@Pdf.Exp@PDF.EXP(?,?)@PDF.EXP(quant, shape)。數值。傳回指數分配的機率密度，此分配具有指定的形狀參數，量為 quant。
pdf.f11=11@Pdf.F@PDF.F(?,?,?)@PDF.F(quant, df1, df2)。數值。傳回 F 分配的機率密度，此分配具有自由度 df1 和 df2，量為 quant。
pdf.gamma11=11@Pdf.Gamma@PDF.GAMMA(?,?,?)@PDF.GAMMA(quant, shape, scale)。數值。傳回 gamma 分配的機率密度，此分配具有指定的形狀和尺度參數，量為 quant。
pdf.geom11=11@Pdf.Geom@PDF.GEOM(?,?)@PDF.GEOM(quant, prob)。數值。傳回成功機率指定為 prob，取得成功的試驗個數等於 quant 的機率。
pdf.halfnrm11=11@Pdf.Halfnrm@PDF.HALFNRM(?,?,?)@PDF.HALFNRM(quant, mean, stddev)。數值。傳回半常態分配的機率密度，此分配具有指定的平均數和標準差，量為 quant。
pdf.hyper11=11@Pdf.Hyper@PDF.HYPER(?,?,?,?)@PDF.HYPER(quant, total, sample, hits)。數值。傳回從拜訪人數有指定特色的所有大小範圍中隨機選取樣本物件時，具有指定特性的物件個數等於 quant 的機率。
pdf.igauss11=11@Pdf.Igauss@PDF.IGAUSS(?,?,?)@PDF.IGAUSS(quant, loc, scale)。數值。傳回反向 Gaussian 分配的機率密度，此分配具有指定的位置和尺度參數，量為 quant。
pdf.laplace11=11@Pdf.Laplace@PDF.LAPLACE(?,?,?)@PDF.LAPLACE(quant, mean, scale)。數值。傳回 Laplace 分配的機率密度，此分配具有指定的平均數和尺度參數，量為 quant。
pdf.lnormal11=11@Pdf.Lnormal@PDF.LNORMAL(?,?,?)@PDF.LNORMAL(quant, a, b)。數值。傳回對數常態分配的機率密度，此分配具有指定的參數，量為 quant。
pdf.logistic11=11@Pdf.Logistic@PDF.LOGISTIC(?,?,?)@PDF.LOGISTIC(quant, mean, scale)。數值。傳回 Logistic 分配的機率密度，此分配具有指定的平均數和尺度參數，量為 quant。
pdf.negbin11=11@Pdf.Negbin@PDF.NEGBIN(?,?,?)@PDF.NEGBIN(quant, thresh, prob)。數值。傳回門檻參數為 thresh，成功機率指定為 prob 時，取得成功的試驗個數等於 quant 的機率。
pdf.normal11=11@Pdf.Normal@PDF.NORMAL(?,?,?)@PDF.NORMAL(quant, mean, stddev)。數值。傳回常態分配的機率密度，此分配具有指定的平均數和標準差，量為 quant。
pdf.pareto11=11@Pdf.Pareto@PDF.PARETO(?,?,?)@PDF.PARETO(quant, threshold, shape)。數值。傳回 Pareto 分配的機率密度，此分配具有指定的門檻值和尺度參數，量為 quant。
pdf.poisson11=11@Pdf.Poisson@PDF.POISSON(?,?)@PDF.POISSON(quant, mean)。數值。傳回來自 Poisson 分配的數值等於 quant，而具有指定平均數或比率參數的機率。
pdf.t11=11@Pdf.T@PDF.T(?,?)@PDF.T(quant, df)。數值。傳回 Student's t 分配的機率密度，此分配具有指定的自由度 df，量為 quant。
pdf.uniform11=11@Pdf.Uniform@PDF.UNIFORM(?,?,?)@PDF.UNIFORM(quant, min, max)。數值。傳回均勻分配的機率密度，此分配具有指定的最大值和最小值，量為 quant。
pdf.weibull11=11@Pdf.Weibull@PDF.WEIBULL(?,?,?)@PDF.WEIBULL(quant, a, b)。數值。傳回 Weibull 分配的機率密度，此分配具有指定的參數，量為 quant。
range13=13@Range@RANGE(?,?,?)@RANGE(test,lo,hi[,lo,hi,..])。邏輯。若檢定在任何由成對的 lo 和 hi 所定義的任何範圍之內，則傳回 1 或 true。引數必須全部是長度相同的數字或字串，而且每個成對的 lo 和 hi 必須按照 lo <= hi 排序。注意：對於字串數值，即使字元設置相同，但因各國使用的核對序列不同，結果可能因地區而異。語言次序 (非 ASCII 次序) 會決定特定字元須位於序列中的什麼位置。
replace(3)13=13@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4])。字串。在 a1 中，a2 的實例用 a3 置換。*a4 為選擇性的引數，它指定置換的發生次數；若省略 a4，則所有的發生次數都會進行置換。引數 a1、a2 和 a3 必須解成字串值 (加上引號的文字字串，或字串變數)，且選擇性的引數 a4 必須解成非負值的整數。例如，REPLACE("abcabc", "a", "x") 會傳回 "xbcxbc" 的數值，而 REPLACE("abcabc", "a", "x", 1) 則傳回 "xbcabc" 的數值。
replace(4)13=13@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4])。字串。在 a1 中，a2 的實例用 a3 置換。*a4 為選擇性的引數，它指定置換的發生次數；若省略 a4，則所有的發生次數都會進行置換。引數 a1、a2 和 a3 必須解成字串值 (加上引號的文字字串，或字串變數)，且選擇性的引數 a4 必須解成非負值的整數。例如，REPLACE("abcabc", "a", "x") 會傳回 "xbcxbc" 的數值，而 REPLACE("abcabc", "a", "x", 1) 則傳回 "xbcabc" 的數值。
replace(3)16=16@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4])。字串。在 a1 中，a2 的實例用 a3 置換。*a4 為選擇性的引數，它指定置換的發生次數；若省略 a4，則所有的發生次數都會進行置換。引數 a1、a2 和 a3 必須解成字串值 (加上引號的文字字串，或字串變數)，且選擇性的引數 a4 必須解成非負值的整數。例如，REPLACE("abcabc", "a", "x") 會傳回 "xbcxbc" 的數值，而 REPLACE("abcabc", "a", "x", 1) 則傳回 "xbcabc" 的數值。
replace(4)16=16@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4])。字串。在 a1 中，a2 的實例用 a3 置換。*a4 為選擇性的引數，它指定置換的發生次數；若省略 a4，則所有的發生次數都會進行置換。引數 a1、a2 和 a3 必須解成字串值 (加上引號的文字字串，或字串變數)，且選擇性的引數 a4 必須解成非負值的整數。例如，REPLACE("abcabc", "a", "x") 會傳回 "xbcxbc" 的數值，而 REPLACE("abcabc", "a", "x", 1) 則傳回 "xbcabc" 的數值。
rnd(1)1=1@Rnd(1)@RND(?)@RND(numexpr[,mult,fuzzbits])。數值。包含單一引數，傳回與該引數最靠近的整數。結尾就是 .5 的數值會從 0 捨入。例如，RND(-4.5) 會捨入成 -5。選擇性的第二個引數 mult 會指定結果為整數倍的此值—例如，RND(-4.57,0.1) = -4.6。該值必須是不為 0 的整數。預設值為 1。選擇性的第三個引數 fuzzbits 是最小顯著位元數。根據此位元數，numexpr 可能會低於四捨五入 (例如，0.5 捨入成整數) 的門檻，但仍會四捨五入。如果略過，系統使用 FUZZBITS (將安裝時間設在 6 ) 設定。
rnd(2)1=1@Rnd(2)@RND(?,?)@RND(numexpr[,mult,fuzzbits])。數值。包含單一引數，傳回與該引數最靠近的整數。結尾就是 .5 的數值會從 0 捨入。例如，RND(-4.5) 會捨入成 -5。選擇性的第二個引數 mult 會指定結果為整數倍的此值—例如，RND(-4.57,0.1) = -4.6。該值必須是不為 0 的整數。預設值為 1。選擇性的第三個引數 fuzzbits 是最小顯著位元數。根據此位元數，numexpr 可能會低於四捨五入 (例如，0.5 捨入成整數) 的門檻，但仍會四捨五入。如果略過，系統使用 FUZZBITS (將安裝時間設在 6 ) 設定。
rnd(3)1=1@Rnd(3)@RND(?,?,?)@RND(numexpr[,mult,fuzzbits])。數值。包含單一引數，傳回與該引數最靠近的整數。結尾就是 .5 的數值會從 0 捨入。例如，RND(-4.5) 會捨入成 -5。選擇性的第二個引數 mult 會指定結果為整數倍的此值—例如，RND(-4.57,0.1) = -4.6。該值必須是不為 0 的整數。預設值為 1。選擇性的第三個引數 fuzzbits 是最小顯著位元數。根據此位元數，numexpr 可能會低於四捨五入 (例如，0.5 捨入成整數) 的門檻，但仍會四捨五入。如果略過，系統使用 FUZZBITS (將安裝時間設在 6 ) 設定。
rtrim(1)16=16@Rtrim(1)@RTRIM(?)@RTRIM(strexpr[,char])。字串。系統會刪除 strexpr 內，char 的尾隨實例。選擇性的第二個引數 char 是單一引號字元，或是可以產生單一字元的運算式。若是省略 char，則會刪除尾隨空白。
rtrim(2)16=16@Rtrim(2)@RTRIM(?,?)@RTRIM(strexpr[,char])。字串。系統會刪除 strexpr 內，char 的尾隨實例。選擇性的第二個引數 char 是單一引號字元，或是可以產生單一字元的運算式。若是省略 char，則會刪除尾隨空白。
rv.bernoulli12=12@Rv.Bernoulli@RV.BERNOULLI(?)@RV.BERNOULLI(prob)。數值。傳回從 Bernoulli 分配隨機選出的數值，且此數值含有指定的機率參數 prob。
rv.beta12=12@Rv.Beta@RV.BETA(?,?)@RV.BETA(shape1, shape2)。數值。傳回從 Beta 分配隨機選出的數值，且此數值含有指定的形狀參數。
rv.binom12=12@Rv.Binom@RV.BINOM(?,?)@RV.BINOM(n, prob)。數值。傳回從二項式分配隨機選出的數值，且此數值含有指定的試驗次數和機率參數。
rv.cauchy12=12@Rv.Cauchy@RV.CAUCHY(?,?)@RV.CAUCHY(loc, scale)。數值。傳回從 Cauchy 分配隨機選出的數值，且此數值含有指定的位置和尺度參數。
rv.chisq12=12@Rv.Chisq@RV.CHISQ(?)@RV.CHISQ(df)。數值。傳回從卡方分配隨機選出的數值，且此數值含有指定的自由度 df。
rv.exp12=12@Rv.Exp@RV.EXP(?)@RV.EXP(scale)。數值。傳回從指數分配隨機選出的數值，且此數值含有指定的尺度參數。
rv.f12=12@Rv.F@RV.F(?,?)@RV.F(df1, df2)。數值。傳回從 F 分配隨機選出的數值，且此數值含有指定的自由度 df1 和自由度 df2。
rv.gamma12=12@Rv.Gamma@RV.GAMMA(?,?)@RV.GAMMA(shape, scale)。數值。傳回從 Gamma 分配隨機選出的數值，且此數值含有指定的形狀和尺度參數。
rv.geom12=12@Rv.Geom@RV.GEOM(?)@RV.GEOM(prob)。數值。傳回從幾何分配隨機選出的數值，且此數值含有指定的機率參數。
rv.halfnrm12=12@Rv.Halfnrm@RV.HALFNRM(?)@RV.HALFNRM(mean, stddev)。數值。傳回從半常態分配隨機選出的數值，且此數值含有指定的平均數和標準差。
rv.hyper12=12@Rv.Hyper@RV.HYPER(?,?,?)@RV.HYPER(total, sample, hits)。數值。傳回從超幾何分配隨機選出的數值，且此數值含有指定的參數。
rv.igauss12=12@Rv.Igauss@RV.IGAUSS(?,?)@RV.IGAUSS(loc, scale)。數值。傳回從逆 Gaussian 分配隨機選出的數值，且此數值含有指定的位置和尺度參數。
rv.laplace12=12@Rv.Laplace@RV.LAPLACE(?,?)@RV.LAPLACE(mean, scale)。數值。傳回從 Laplace 分配隨機選出的數值，且此數值含有指定的平均數和尺度參數。
rv.lnormal12=12@Rv.Lnormal@RV.LNORMAL(?,?)@RV.LNORMAL(a, b)。數值。傳回從對數常態分配隨機選出的數值，且此數值含有指定的參數。
rv.logistic12=12@Rv.Logistic@RV.LOGISTIC(?,?)@RV.LOGISTIC(mean, scale)。數值。傳回從 Logistic 分配隨機選出的數值，且此數值含有指定的平均數和尺度參數。
rv.negbin12=12@Rv.Negbin@RV.NEGBIN(?,?)@RV.NEGBIN(threshold, prob)。數值。傳回從負二項式分配隨機選出的數值，且此數值含有指定的門檻和機率參數。
rv.normal12=12@Rv.Normal@RV.NORMAL(?,?)@RV.NORMAL(mean, stddev)。數值。傳回從常態分配隨機選出的數值，且此數值含有指定的平均數和標準差。
rv.pareto12=12@Rv.Pareto@RV.PARETO(?,?)@RV.PARETO(threshold, shape)。數值。傳回從 Pareto 分配隨機選出的數值，且此數值含有指定的門檻和形狀參數。
rv.poisson12=12@Rv.Poisson@RV.POISSON(?)@RV.POISSON(mean)。數值。傳回從 Poisson 分配隨機選出的數值，且此數值含有指定的平均數/比率參數。
rv.t12=12@Rv.T@RV.T(?)@RV.T(df)。數值。傳回從 Student's t 分配隨機選出的數值，且此數值含有指定的自由度 df。
rv.uniform12=12@Rv.Uniform@RV.UNIFORM(?,?)@RV.UNIFORM(min, max)。數值。傳回從均勻分配隨機選出的數值，且此數值含有指定的最小值和最大值。請參閱 UNIFORM 函數。
rv.weibull12=12@Rv.Weibull@RV.WEIBULL(?,?)@RV.WEIBULL(a, b)。數值。傳回從 Weibull 分配隨機選出的數值，且此數值含有指定的參數。
sd15=15@Sd@SD(?,?)@SD(numexpr,numexpr[,..])。數值。傳回其引數的標準差，該引數包含有效值和未遺漏值。此函數需要兩個或以上的引數 (必須是數值)。您可為此要評估的函數指定有效引數的最小個數。
sig.chisq14=14@Sig.Chisq@SIG.CHISQ(?)@SIG.CHISQ(quant, df)。數值。傳回數值大於量的累積機率，該數值來自帶有 df 自由度的卡方分配。
sig.f14=14@Sig.F@SIG.F(?)@SIG.F(quant, df1, df2)。數值。傳回數值大於量的累積機率，該數值來自帶有 df1 與 df2 自由度的 F 分配。
sin1=1@Sin@SIN(?)@SIN(radians)。數值。傳回以弧度測量的弧度正弦 (其必須為數值)。
sqrt1=1@Sqrt@SQRT(?)@SQRT(numexpr)。數值。傳回以 numexpr 的正平方根，其必須為數字，且不為負數。
strapplymodel19=19@Strapplymodel@StrApplyModel(?,?,?)@StrApplyModel(handle, "function", value).字串。使用 handle 指定的模式，將特定分數函數套用至輸入觀察值資料，而其中的 "function" 屬於下列用引號括住的字串文字值之一：predict、stddev、probability、confidence、nodeid、cumhazard、neighbor、distance。模式處理為與外部 XML 檔案相關的名稱，如 MODEL HANDLE 指令所定義。選擇性的第三個引數在函數為「probability」、 「neighbor」或「distance」時適用。「probability」設定一個分類，在其中計算機率。至於 "neighbor" 和 "distance" 則指定 neighbor (為整數) 作為鄰近 neighbor 的模式。如果無法計算數值，StrApplyModel 會傳回空白字串。
string3=3@String@STRING(?,?)@STRING (numexpr,format)。字串。會傳回 numexpr 根據格式轉換成字串時所產生的字串。STRING (-1.5，F5.2) 會傳回字串值 '-1.50'。第二個引數的格式必須為可供寫入數值的格式。
strunc16=16@Strunc@STRUNC(?,?)@STRUNC (strexp, length)。字串。會傳回被截斷成長度(以位元組為單位) 並刪除任何尾隨空白的 strexp。截斷會移除任何要截斷的字元片段。
sum15=15@Sum@SUM(?,?)@SUM (numexpr,numexpr[,..])。數值。傳回其引數的總和，該引數包含有效值和未遺漏值。此函數需要兩個或以上的引數 (必須是數值)。您可為此要評估的函數指定有效引數的最小個數。
sysmis10=10@Sysmis@SYSMIS(?)@SYSMIS (numvar)。邏輯。如果 numvar 值為系統遺漏值，會傳回 1 或 true。引數 numvar 必須是作用中資料集的數值變數名稱。
time.days17=17@Time.Days@TIME.DAYS(?)@TIME.DAYS(days)。數值。可傳回對應到表示天數的時間間隔。引數必須是數值。若要將結果顯示為時間，請將時間格式指定成結果變數。
time.hms(1)17=17@Time.Hms(1)@TIME.HMS(?)@TIME.HMS(hours[,minutes,seconds])。數值。可傳回對應到表示小時、分鐘及秒數的時間間隔。分鐘和秒數的引數為選擇性。如果任何較高階的引數不是零，分鐘數和秒數則必須解析至小於 60。除了最後一個非零的引數之外，所有的引數都必須分解成整數。例如，TIME.HMS(25.5) 及 TIME.HMS(0,90,25.5) 有效，但 TIME.HMS(25.5,30) 及 TIME.HMS(25,90) 無效。所有的引數都必須解析至正數值或負數值。若要將結果顯示為時間，請將時間格式指定成結果變數。
time.hms(2)17=17@Time.Hms(2)@TIME.HMS(?,?)@TIME.HMS(hours[,minutes,seconds])。數值。可傳回對應到表示小時、分鐘及秒數的時間間隔。分鐘和秒數的引數為選擇性。如果任何較高階的引數不是零，分鐘數和秒數則必須解析至小於 60。除了最後一個非零的引數之外，所有的引數都必須分解成整數。例如，TIME.HMS(25.5) 及 TIME.HMS(0,90,25.5) 有效，但 TIME.HMS(25.5,30) 及 TIME.HMS(25,90) 無效。所有的引數都必須解析至正數值或負數值。若要將結果顯示為時間，請將時間格式指定成結果變數。
time.hms(3)17=17@Time.Hms(3)@TIME.HMS(?,?,?)@TIME.HMS(hours[,minutes,seconds])。數值。可傳回對應到表示小時、分鐘及秒數的時間間隔。分鐘和秒數的引數為選擇性。如果任何較高階的引數不是零，分鐘數和秒數則必須解析至小於 60。除了最後一個非零的引數之外，所有的引數都必須分解成整數。例如，TIME.HMS(25.5) 及 TIME.HMS(0,90,25.5) 有效，但 TIME.HMS(25.5,30) 及 TIME.HMS(25,90) 無效。所有的引數都必須解析至正數值或負數值。若要將結果顯示為時間，請將時間格式指定成結果變數。
trunc(1)1=1@Trunc(1)@TRUNC(?)@TRUNC(numexpr[,mult,fuzzbits])。數值。會傳回截斷至 0 的 numexpr 值。選擇性的第二個引數 mult 會指定結果為整數倍的此值—例如，TRUNC(4.579,0.1) = 4.5。該值必須是不為 0 的整數。預設值為 1。選擇性的第三個引數 fuzzbits 為 numexpr 可能比最接近捨入範圍稍低且在截斷之前捨入的最小顯著位元數。例如，如果 numexpr 介於 1.4 和 1.5 之間，且 mult 為 0.1，則 fuzzbits 會指定 numexpr 可以接近 1.5 的程度 (最接近的範圍) 並將其捨入。如果略過，系統使用FUZZBITS (將安裝時間設在 6 ) 設定。
trunc(2)1=1@Trunc(2)@TRUNC(?,?)@TRUNC(numexpr[,mult,fuzzbits])。數值。會傳回截斷至 0 的 numexpr 值。選擇性的第二個引數 mult 會指定結果為整數倍的此值—例如，TRUNC(4.579,0.1) = 4.5。該值必須是不為 0 的整數。預設值為 1。選擇性的第三個引數 fuzzbits 為 numexpr 可能比最接近捨入範圍稍低且在截斷之前捨入的最小顯著位元數。例如，如果 numexpr 介於 1.4 和 1.5 之間，且 mult 為 0.1，則 fuzzbits 會指定 numexpr 可以接近 1.5 的程度 (最接近的範圍) 並將其捨入。如果略過，系統使用FUZZBITS (將安裝時間設在 6 ) 設定。
trunc(3)1=1@Trunc(3)@TRUNC(?,?,?)@TRUNC(numexpr[,mult,fuzzbits])。數值。會傳回截斷至 0 的 numexpr 值。選擇性的第二個引數 mult 會指定結果為整數倍的此值—例如，TRUNC(4.579,0.1) = 4.5。該值必須是不為 0 的整數。預設值為 1。選擇性的第三個引數 fuzzbits 為 numexpr 可能比最接近捨入範圍稍低且在截斷之前捨入的最小顯著位元數。例如，如果 numexpr 介於 1.4 和 1.5 之間，且 mult 為 0.1，則 fuzzbits 會指定 numexpr 可以接近 1.5 的程度 (最接近的範圍) 並將其捨入。如果略過，系統使用FUZZBITS (將安裝時間設在 6 ) 設定。
upcase16=16@Upcase@UPCASE(?)@UPCASE(strexpr)。字串。會傳回小寫字母變更成大寫字母和未變更其他字元的 strexpr。
value10=10@Value@VALUE(?)@VALUE(變數)。數字或字串。會傳回必須是變數名稱或變數名稱之向量參考的變數值 (忽略變數的使用者遺漏值定義)。
valuelabel9=9@Valuelabel@VALUELABEL(?)@NTRIM(變數名稱)。字串。如果數值沒有標記，則會傳回變數值或空字串的數值標記。Varname 的數值必須是變數名稱，不能是運算式。
variance15=15@Variance@VARIANCE(?,?)@VARIANCE(numexpr,numexpr[,..])。數值。傳回其包含有效值的引數變異數。此函數需要兩個或以上的引數 (必須是數值)。您可為此要評估的函數指定有效引數的最小個數。
xdate.date7=7@Xdate.Date@XDATE.DATE(?)@XDATE.DATE(datevalue)。數值。從表示日期的數值傳回日期部分。引數可為數字、日期格式變數或解析為日期的運算式。若要將結果顯示為日期，請將日期格式套用至變數。
xdate.hour18=18@Xdate.Hour@XDATE.HOUR(?)@XDATE.HOUR(datetime)。數值。從表示時間或日期時間的數值傳回小時 (介於 0 和 23 之間的整數)。引數可為數字、時間或日期時間變數，或解析為時間或日期時間值的運算式。
xdate.jday7=7@Xdate.Jday@XDATE.JDAY(?)@XDATE.DATE(datevalue)。數值。從表示日期的數值傳回年中天數 (介於 1 和 366 之間的整數)。引數可為數字、日期格式變數或解析為日期的運算式。
xdate.mday7=7@Xdate.Mday@XDATE.MDAY(?)@XDATE.MDAY(datevalue)。數值。從表示日期的數值傳回月中天數 (介於 1 和 31 之間的整數)。引數可為數字、日期格式變數或解析為日期的運算式。
xdate.minute18=18@Xdate.Minute@XDATE.MINUTE(?)@XDATE.MINUTE(datetime)。數值。從表示時間或日期時間的數值傳回分鐘 (介於 0 和 59 之間的整數)。引數可為數字、時間或日期時間變數，或解析為時間或日期時間值的運算式。
xdate.month7=7@Xdate.Month@XDATE.MONTH(?)@XDATE.MONTH(datevalue)。數值。從表示日期的數值傳回月份 (介於 1 和 12 之間的整數)。引數可為數字、日期格式變數或解析為日期的運算式。
xdate.quarter7=7@Xdate.Quarter@XDATE.QUARTER(?)@XDATE.QUARTER(datevalue)。數值。從表示日期的數值傳回四分之一年 (介於 1 和 4 之間的整數)。引數可為數字、日期格式變數或解析為日期的運算式。
xdate.second18=18@Xdate.Second@XDATE.SECOND(?)@XDATE.SECOND(datetime)。數值。從表示時間或日期時間的數值傳回秒數 (介於 0 和 60 之間的數字)。引數可為數字、時間或日期時間變數，或解析為時間或日期時間值的運算式。
xdate.tday7=7@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(timevalue)。數值。從表示時間間隔的數值傳回整天天數 (整數)。引數可為數字、時間格式變數或解析為時間間隔的運算式。
xdate.tday18=18@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(timevalue)。數值。從表示時間間隔的數值傳回整天天數 (整數)。引數可為數字、時間格式變數或解析為時間間隔的運算式。
xdate.time7=7@Xdate.Time@XDATE.TIME(?)@XDATE.TIME(datetime)。數值。從表示時間或日期時間的數值傳回時間部分。引數可為數字、時間或日期時間變數，或解析為時間或日期時間值的運算式。若要將結果顯示為時間，請將時間格式套用至變數。
xdate.week7=7@Xdate.Week@XDATE.WEEK(?)@XDATE.WEEK(datevalue)。數值。從表示日期的數值傳回週數 (介於 1 和 53 之間的整數)。引數可為數字、日期格式變數或解析為日期的運算式。
xdate.wkday7=7@Xdate.Wkday@XDATE.WKDAY(?)@XDATE.WKDAY(datevalue)。數值。從表示日期的數值傳回星期幾的天數 (介於 1、星期日和 7、星期六之間的整數)。引數可為數字、日期格式變數或解析為日期的運算式。
xdate.year7=7@Xdate.Year@XDATE.YEAR(?)@XDATE.YEAR(datevalue)。數值。從表示日期的數值傳回年份 (為四位數的整數)。引數可為數字、日期格式變數或解析為日期的運算式。
yrmoda7=7@Yrmoda@YRMODA(?,?,?)@YRMODA(year,month,day)。數值。將 1582 年 10 月15 日後的天數傳回至由引數年份、月份及日數表示的日期，且必須為構成 1582 年 10 月 15 日以後有效日期的整數。二位數值的年份會依「選項」設定 (「編輯」功能表、「選項」、「資料」索引標籤) 假設為世紀。在未特別定義時，2 位數的年份是假設成目前日期之前的 69 年，以及目前日期之後的 30 年..
